[{"description":"Create a mystical landing page with dark cosmic theme. At the top, show a dramatic hero section with the cloaked messenger image (cloaked-messenger-portrait-KakJfYU78kjRavrkE3GIf.png) and text that says 'IT'S NO COINCIDENCE YOU'RE HERE' in glowing neon letters. Below that, add mysterious text: 'I AM... intercepting your frequency. You clicked because your soul remembers. This is your first step out of the simulation.' Include a glowing CTA button that says 'BEGIN AWAKENING'. Use deep space purple and blue colors with matrix-style glowing effects. Add subtle animation to text and buttons.","type":"feature","passes":true,"id":1},{"description":"Create a phone-hack style funnel page that looks like secret messages being texted. Use the phone-hack-interface image as background inspiration. Show conversation-style messages that appear like texts: 'Incoming transmission...', 'Your frequency detected...', 'Initiating soul scan...', 'MATCH FOUND: Cosmic Warrior Soul'. Add glowing cipher symbols and matrix code effects. Include a 'DECRYPT MESSAGE' button that leads to the next step. Make it feel like someone is hacking into their phone to deliver divine messages.","type":"feature","passes":true,"id":2},{"description":"Create a book series showcase page for 'Cosmic Soul Quest'. Show book cover placeholder with title and description: 'A teenage boy discovers his soul is from another dimension. He's part of an ancient group of seven cosmic warriors who must reunite to save Earth's frequency from collapsing into the void. Blending quantum physics with ancient mysticism, this series will awaken your true cosmic identity.' Add 'GET BOOK NOW' button with pricing options. Use cosmic-quantum-background image.","type":"feature","passes":true,"id":3},{"description":"Create a section for Galactic Star Crystal Academy. Show mystical-physics-symbols image as background. Add heading 'GALACTIC STAR CRYSTAL ACADEMY' with description: 'Advanced training for awakened souls. Learn the seven secret steps to remember who you truly are. Master quantum manifestation and cosmic frequency alignment.' Include 'JOIN ACADEMY' CTA button and space for pricing tiers.","type":"feature","passes":true,"id":4},{"description":"Add a multi-step funnel flow. Create Step 1: Secret Code Entry (looks like entering a passcode on phone), Step 2: Soul Recognition (personality quiz style), Step 3: Frequency Match (reveals their cosmic warrior archetype), Step 4: Awakening Offer (book + academy bundle with countdown timer). Each step should feel like unlocking classified information.","type":"feature","passes":true,"id":5},{"description":"Add social media integration section in footer with icon links for Instagram, TikTok, YouTube, Facebook. Add email signup form styled like 'encrypted communication channel'. Include contact section that says 'ESTABLISH DIRECT FREQUENCY LINK' instead of normal contact form.","type":"feature","passes":true,"id":6},{"description":"Change the text 'THE AWAKENING' to 'DISCOVERY' in the book showcase section","type":"feature","passes":true,"id":7},{"description":"Update the Instagram social media link in the footer to link to @Cosmic_soul_quest Instagram profile (https://instagram.com/Cosmic_soul_quest)","type":"feature","passes":true,"id":8}]
