[{"description": "Create a mystical landing page with dark cosmic theme. At the top, show a dramatic hero section with the cloaked messenger image (cloaked-messenger-portrait-KakJfYU78kjRavrkE3GIf.png) and text that says 'IT'S NO COINCIDENCE YOU'RE HERE' in glowing neon letters. Below that, add mysterious text: 'I AM... intercepting your frequency. You clicked because your soul remembers. This is your first step out of the simulation.' Include a glowing CTA button that says 'BEGIN AWAKENING'. Use deep space purple and blue colors with matrix-style glowing effects. Add subtle animation to text and buttons.", "type": "feature", "passes": true, "id": 1}, {"description": "Create a phone-hack style funnel page that looks like secret messages being texted. Use the phone-hack-interface image as background inspiration. Show conversation-style messages that appear like texts: 'Incoming transmission...', 'Your frequency detected...', 'Initiating soul scan...', 'MATCH FOUND: Cosmic Warrior Soul'. Add glowing cipher symbols and matrix code effects. Include a 'DECRYPT MESSAGE' button that leads to the next step. Make it feel like someone is hacking into their phone to deliver divine messages.", "type": "feature", "passes": true, "id": 2}, {"description": "Create a book series showcase page for 'Cosmic Soul Quest'. Show book cover placeholder with title and description: 'A teenage boy discovers his soul is from another dimension. He's part of an ancient group of seven cosmic warriors who must reunite to save Earth's frequency from collapsing into the void. Blending quantum physics with ancient mysticism, this series will awaken your true cosmic identity.' Add 'GET BOOK NOW' button with pricing options. Use cosmic-quantum-background image.", "type": "feature", "passes": true, "id": 3}, {"description": "Create a section for Galactic Star Crystal Academy. Show mystical-physics-symbols image as background. Add heading 'GALACTIC STAR CRYSTAL ACADEMY' with description: 'Advanced training for awakened souls. Learn the seven secret steps to remember who you truly are. Master quantum manifestation and cosmic frequency alignment.' Include 'JOIN ACADEMY' CTA button and space for pricing tiers.", "type": "feature", "passes": true, "id": 4}, {"description": "Add a multi-step funnel flow. Create Step 1: Secret Code Entry (looks like entering a passcode on phone), Step 2: Soul Recognition (personality quiz style), Step 3: Frequency Match (reveals their cosmic warrior archetype), Step 4: Awakening Offer (book + academy bundle with countdown timer). Each step should feel like unlocking classified information.", "type": "feature", "passes": true, "id": 5}, {"description": "Add social media integration section in footer with icon links for Instagram, TikTok, YouTube, Facebook. Add email signup form styled like 'encrypted communication channel'. Include contact section that says 'ESTABLISH DIRECT FREQUENCY LINK' instead of normal contact form.", "type": "feature", "passes": true, "id": 6}, {"description": "Change the text 'THE AWAKENING' to 'DISCOVERY' in the book showcase section", "type": "feature", "passes": true, "id": 7}, {"description": "Update the Instagram social media link in the footer to link to @Cosmic_soul_quest Instagram profile (https://instagram.com/Cosmic_soul_quest)", "type": "feature", "passes": true, "id": 8}, {"description": "Add prominent Instagram branding throughout the site. In the hero section, add text above the main headline that says 'FROM INSTAGRAM: @Cosmic_soul_quest' with the Instagram logo. Make it look like this content is being delivered through Instagram.", "type": "feature", "passes": true, "id": 9}, {"description": "Add Instagram story-style progress bars at the very top of the page to make it feel like viewing Instagram stories. Add Instagram UI elements like the share arrow, three dots menu, and heart icon in the top right corner.", "type": "feature", "passes": true, "id": 10}, {"description": "Convert all CTA buttons to say 'TAP TO CONTINUE' or 'SWIPE UP' instead of generic button text, matching Instagram story interaction patterns. Make buttons look more like Instagram story tap areas.", "type": "feature", "passes": true, "id": 11}, {"description": "Add 'Link in Bio' style section that shows @Cosmic_soul_quest with a list of clickable links: 'Read the Book', 'Join Academy', 'Start Awakening Journey', 'Contact'. Style it exactly like an Instagram bio link page (Linktree style).", "type": "feature", "passes": true, "id": 12}, {"description": "Add Instagram-style engagement prompts throughout: 'Double tap if you feel this ❤️', 'Tag someone who needs to see this 👇', 'Share this to your story ✨', 'DM me AWAKEN to start 📩'. Place these strategically between sections.", "type": "feature", "passes": true, "id": 13}, {"description": "Make the phone-hack funnel section look like Instagram DMs. Show it as a conversation thread with @Cosmic_soul_quest sending messages. Add Instagram DM UI elements like the camera icon, info button, and message input bar at the bottom.", "type": "feature", "passes": true, "id": 14}, {"description": "Add Instagram feed section to the homepage that displays recent posts from @Cosmic_soul_quest. Include a grid of Instagram post placeholders with hover effects. Add 'Follow on Instagram' button that links to the profile.", "type": "feature", "passes": true, "id": 15}, {"description": "Add Instagram share buttons throughout the site. When users click 'Share to Instagram Story', it should prepare the content for sharing. Add social share buttons for each major section (book, academy, funnel results) with Instagram-optimized formatting.", "type": "feature", "passes": true, "id": 16}, {"description": "Create a 'Download for Instagram' feature on the funnel completion page. When users finish the soul quiz and get their archetype, add a button to download a custom Instagram story graphic showing their result that they can share.", "type": "feature", "passes": true, "id": 17}, {"description": "Add Instagram-optimized meta tags and Open Graph tags so when the website link is shared on Instagram, it shows the mystical cloaked messenger image with compelling preview text.", "type": "feature", "passes": true, "id": 18}, {"description": "Remove ALL Instagram-style UI elements from the website. Remove: Instagram story bars at top, Instagram DM interface, Instagram feed section, Instagram engagement prompts, Instagram share buttons, Link in Bio section, any '@' mentions or Instagram logos. Keep the mystical phone-hack theme but make it look like a divine/cosmic transmission, not Instagram.", "type": "feature", "passes": true, "id": 19}, {"description": "Update the hero section to feature the cloaked messenger image (cloaked-messenger-portrait-KakJfYU78kjRavrkE3GIf.png) prominently as the divine 'I AM' messenger. Make it look like he is speaking directly to the viewer through their screen. Add glowing effects around him. The message should say 'IT'S NO COINCIDENCE YOU CLICKED HERE... I've been waiting for you.' with mysterious divine energy effects.", "type": "feature", "passes": true, "id": 20}, {"description": "Redesign the phone-hack funnel section to look like a mysterious cosmic transmission, NOT Instagram DMs. Show it as encrypted divine messages appearing on a phone screen with matrix code and sacred geometry. Messages should feel like they're coming from a higher dimensional being, not a social media account.", "type": "feature", "passes": true, "id": 21}, {"description": "Update the footer to have simple social media icon links (Instagram, TikTok, YouTube) without any Instagram-specific styling. Add a simple email signup form. Keep the cosmic/mystical theme consistent throughout.", "type": "feature", "passes": true, "id": 22}, {"description": "Redesign the entire website to be a full-screen tap-to-advance experience like Instagram Stories or TikTok. Remove all scrolling. Each section should be a full-screen slide that fills the viewport. Add a 'TAP TO CONTINUE' button or tap anywhere on screen to advance to next section. Sections: 1) Hero/Landing 2) Divine Message 3) Phone Messages 4) Soul Quiz 5) Book Reveal 6) Academy 7) Final CTA. Add progress dots at top to show which slide you're on.", "type": "feature", "passes": true, "id": 23}, {"description": "Completely redesign the phone messages section to look like it's ACTUALLY the user's phone. Make it look like a real iPhone iMessage interface - blue bubbles for incoming messages, gray for the person's replies. Make the background look like the actual iOS Messages app with contact name at top, signal bars, battery, time showing 3:33 AM. Messages should appear one at a time with typing indicators. Add a realistic 'TAP TO REPLY' button that advances the conversation when clicked.", "type": "feature", "passes": true, "id": 24}, {"description": "Add smooth slide transitions between sections - fade or slide animations when advancing. Make sure each section takes up exactly 100vh (full screen height) with no overflow. Lock scrolling completely - only way to navigate is tapping the advance button or clicking anywhere on the screen.", "type": "feature", "passes": true, "id": 25}, {"description": "Make it mobile-first responsive. On desktop, show it in a phone frame mockup in the center of the screen so it looks like you're viewing someone's phone. On mobile, it should be fullscreen and feel native like an app.", "type": "feature", "passes": true, "id": 26}, {"description": "Convert the entire website from scrolling to tap-to-advance navigation. Make it work like Instagram stories - user taps anywhere on the right side of screen to go to next section, tap left to go back. Add progress bars at the top showing which section they're on. Remove all scroll functionality. Each section (hero, phone messages, book, academy, funnel) becomes a full-screen 'slide' that fills the viewport.", "type": "feature", "passes": true, "id": 27}, {"description": "Completely redesign the phone message section to look like it's appearing on the USER'S actual phone screen, not a separate device. Remove the phone frame mockup. Make the messages appear as if they're SMS text messages or WhatsApp messages coming through on their current device. Add a realistic message notification at the top that slides down. Show messages appearing one by one with typing indicators. Add a glowing 'TAP TO CONTINUE' button that pulses after messages appear.", "type": "feature", "passes": true, "id": 28}, {"description": "Add tap zones - tapping the right 2/3 of screen advances to next section, tapping left 1/3 goes back. Add visual tap indicators (subtle arrows on sides). Add keyboard shortcuts: right arrow = next, left arrow = back, spacebar = next. Make it feel like swiping through stories.", "type": "feature", "passes": true, "id": 29}, {"description": "Fix the 'Claim the Awakening' button and all purchase buttons to actually work. When clicked, they should open a payment modal or redirect to a checkout page. Add a simple checkout modal with fields for email, payment method selection (Stripe/PayPal), and order summary. For now, make it collect email addresses and show 'Payment integration coming soon' message.", "type": "bug", "passes": true, "id": 30}, {"description": "Fix the 'Claim the Awakening' button to actually work. When clicked, it should redirect to a Stripe checkout page for the bundle offer ($197 for Book + Academy access). Add Stripe payment integration using Stripe Checkout. Create a checkout session for the bundle product with price $197. Make sure the button is clickable and triggers the payment flow.", "type": "bug", "passes": true, "id": 31}, {"description": "Add Stripe payment buttons for the Book section with 3 pricing tiers: Digital ($14.99), Paperback ($24.99), Collector's Edition ($39.99). Each button should open a Stripe checkout for that specific product. Add Stripe integration code.", "type": "feature", "passes": true, "id": 32}, {"description": "Add Stripe payment buttons for the Academy section with 3 pricing tiers: Initiate ($47/month), Warrior ($97/month), Master ($197/month). Each button should open a Stripe subscription checkout for recurring monthly payments. Integrate Stripe subscriptions.", "type": "feature", "passes": true, "id": 33}, {"description": "Create a success page that users see after completing payment. Show confirmation message, order details, and next steps. Include a 'Download Book' button for book purchases and 'Access Academy' button for academy subscriptions. Make it feel premium and mystical matching the cosmic theme.", "type": "feature", "passes": true, "id": 34}, {"description": "Update the success page to include an automatic download link for the book. When someone purchases the digital book, add a 'Download Your Book Now' button that downloads the PDF file (cosmic-soul-quest-book.pdf). Make it a prominent glowing button. Add text saying 'Your book is ready! Click below to download your copy.'", "type": "feature", "passes": true, "id": 35}, {"description": "Add the book PDF file to the build so it's available for download. Make sure cosmic-soul-quest-book.pdf is included in the public folder and accessible via download link.", "type": "feature", "passes": true, "id": 36}, {"description": "Make all interactions feel more realistic and natural. Add micro-interactions: buttons should have subtle scale/bounce on hover and click, add haptic-like feedback animations, smooth easing curves on all transitions. Add realistic loading states - when tapping buttons show a brief loading spinner before action. Add subtle sound effect triggers (optional via Web Audio API). Make tap zones feel more responsive with instant visual feedback.", "type": "feature", "passes": true, "id": 37}, {"description": "Improve the phone message section to be even more realistic. Add realistic typing delays between messages (2-4 seconds), make the typing indicator appear for 1-2 seconds before each message shows. Add message 'delivered' and 'read' indicators like real iMessage. Make messages appear with a subtle slide-up animation and slight bounce. Add timestamp every few messages showing realistic time progression (3:33 AM, 3:34 AM, etc.)", "type": "feature", "passes": true, "id": 38}, {"description": "Add realistic physics-based animations. When sliding between sections, add momentum-based easing (ease-out-expo). Add subtle parallax effects on background elements. Make floating elements (like the cloaked messenger) have subtle breathing animation. Add realistic shadow responses when hovering over interactive elements.", "type": "feature", "passes": true, "id": 39}, {"description": "Improve mobile feel - add pull-to-refresh gesture hint, add subtle vibration feedback on important taps (navigator.vibrate), make all interactive elements have proper touch target sizes (minimum 44x44px), add momentum scrolling feel within quiz sections, improve tap response time to feel instant like native apps.", "type": "feature", "passes": true, "id": 40}, {"description": "Make all interactions feel more realistic and natural. Add haptic-style feedback: buttons should have a subtle 'press down' effect when clicked (scale down to 0.95), then spring back. Add realistic touch ripple effects that emanate from where the user taps. Make tap zones feel more responsive with visual feedback - show a quick flash or pulse where the finger touches.", "type": "feature", "passes": true, "id": 41}, {"description": "Improve the iMessage typing experience to be hyper-realistic. Add varied typing speeds (some messages appear faster, some slower). Add random pauses between messages like a real person thinking. Make the typing indicator bounce more naturally. Add a subtle 'message sent' sound effect or visual confirmation when messages appear. Make the timestamps update realistically.", "type": "feature", "passes": true, "id": 42}, {"description": "Add realistic scroll physics and momentum. When users swipe between slides, it should feel like a real phone app with inertia. Add a subtle rubber-band effect if they try to swipe past the first or last slide. Make slide transitions feel more fluid with spring animations instead of linear transitions.", "type": "feature", "passes": true, "id": 43}, {"description": "Add micro-interactions throughout: buttons should glow when hovered, cards should lift slightly on hover, form inputs should have focus states with smooth border animations. Add loading states that feel premium - spinning cosmic symbols instead of generic spinners. Make every interaction feel polished and intentional.", "type": "feature", "passes": true, "id": 44}]
